import datetime


class Parser(object):
    def __init__(self, comp_info, pdf_full_path):
        self.comp_info=comp_info
        self.pdf_full_path=pdf_full_path
        self.need_intervention=0

        self.standard_sections=((0, '释义', ['释义']), (1, '公司简介和主要财务指标', ['公司简介和主要财务指标']), (2, '公司业务概要', ['公司业务概要']), (3, '经营情况讨论与分析', ['经营情况讨论与分析', '管理层讨论与分析']), (4, '重要事项', ['重要事项']), (5, '股份变动及股东情况', ['股份变动及股东情况']), (6, '优先股相关情况', ['优先股相关情况']), (7, '董事监事高级管理人员和员工情况', ['董事监事高级管理人员和员工情况']), (8, '公司治理', ['公司治理']), (9, '公司债券相关情况', ['公司债券相关情况']), (10, '财务报告', ['财务报告']), (11, '备查文件目录', ['备查文件目录']))

        self.standard_fin_subsections={0: ('审计报告', ['审计报告']), 1: ('财务报表', ['财务报表']), 2: ('公司基本情况', ['公司基本情况']), 3: ('财务报表的编制基础', ['财务报表的编制基础']), 4: ('重要会计政策及会计估计', ['重要会计政策及会计估计']), 5: ('税项', ['税项']), 6: ('合并财务报表项目注释', ['合并财务报表项目注释']), 7: ('合并范围的变更', ['合并范围的变更']), 8: ('在其他主体中的权益', ['在其他主体中的权益']), 9: ('与金融工具相关的风险', ['与金融工具相关的风险']), 10: ('公允价值的披露', ['公允价值的披露']), 11: ('关联方及关联交易', ['关联方及关联交易']), 12: ('股份支付', ['股份支付']), 13: ('承诺及或有事项', ['承诺及或有事项']), 14: ('资产负债表日后事项', ['资产负债表日后事项']), 15: ('其他重要事项', ['其他重要事项']), 16: ('母公司财务报表主要项目注释', ['母公司财务报表主要项目注释']), 17: ('补充资料', ['补充资料'])}

        self.tools_num_arabic2cn={1: '一', 2: '二', 3: '三', 4: '四', 5: '五', 6: '六', 7: '七', 8: '八', 9: '九', 10: '十', 11: '十一', 12: '十二', 13: '十三', 14: '十四', 15: '十五', 16: '十六', 17: '十七', 18: '十八', 19: '十九', 20: '二十', 21: '二十一', 22: '二十二', 23: '二十三', 24: '二十四', 25: '二十五', 26: '二十六', 27: '二十七', 28: '二十八', 29: '二十九', 30: '三十', 31: '三十一', 32: '三十二', 33: '三十三', 34: '三十四', 35: '三十五', 36: '三十六', 37: '三十七', 38: '三十八', 39: '三十九', 40: '四十', 41: '四十一', 42: '四十二', 43: '四十三', 44: '四十四', 45: '四十五', 46: '四十六', 47: '四十七', 48: '四十八', 49: '四十九', 50: '五十', 51: '五十一', 52: '五十二', 53: '五十三', 54: '五十四', 55: '五十五', 56: '五十六', 57: '五十七', 58: '五十八', 59: '五十九', 60: '六十', 61: '六十一', 62: '六十二', 63: '六十三', 64: '六十四', 65: '六十五', 66: '六十六', 67: '六十七', 68: '六十八', 69: '六十九', 70: '七十', 71: '七十一', 72: '七十二', 73: '七十三', 74: '七十四', 75: '七十五', 76: '七十六', 77: '七十七', 78: '七十八', 79: '七十九', 80: '八十', 81: '八十一', 82: '八十二', 83: '八十三', 84: '八十四', 85: '八十五', 86: '八十六', 87: '八十七', 88: '八十八', 89: '八十九', 90: '九十', 91: '九十一', 92: '九十二', 93: '九十三', 94: '九十四', 95: '九十五', 96: '九十六', 97: '九十七', 98: '九十八', 99: '九十九', 100: '一百' }
        self.tools_num_cn2arabic={'一': 1, '二': 2, '三': 3, '四': 4, '五': 5, '六': 6, '七': 7, '八': 8, '九': 9, '十': 10, '十一': 11, '十二': 12, '十三': 13, '十四': 14, '十五': 15, '十六': 16, '十七': 17, '十八': 18, '十九': 19, '二十': 20, '二十一': 21, '二十二': 22, '二十三': 23, '二十四': 24, '二十五': 25, '二十六': 26, '二十七': 27, '二十八': 28, '二十九': 29, '三十': 30, '三十一': 31, '三十二': 32, '三十三': 33, '三十四': 34, '三十五': 35, '三十六': 36, '三十七': 37, '三十八': 38, '三十九': 39, '四十': 40, '四十一': 41, '四十二': 42, '四十三': 43, '四十四': 44, '四十五': 45, '四十六': 46, '四十七': 47, '四十八': 48, '四十九': 49, '五十': 50, '五十一': 51, '五十二': 52, '五十三': 53, '五十四': 54, '五十五': 55, '五十六': 56, '五十七': 57, '五十八': 58, '五十九': 59, '六十': 60, '六十一': 61, '六十二': 62, '六十三': 63, '六十四': 64, '六十五': 65, '六十六': 66, '六十七': 67, '六十八': 68, '六十九': 69, '七十': 70, '七十一': 71, '七十二': 72, '七十三': 73, '七十四': 74, '七十五': 75, '七十六': 76, '七十七': 77, '七十八': 78, '七十九': 79, '八十': 80, '八十一': 81, '八十二': 82, '八十三': 83, '八十四': 84, '八十五': 85, '八十六': 86, '八十七': 87, '八十八': 88, '八十九': 89, '九十': 90, '九十一': 91, '九十二': 92, '九十三': 93, '九十四': 94, '九十五': 95, '九十六': 96, '九十七': 97, '九十八': 98, '九十九': 99, '一百': 100}




    from .read_in_pdf import read_in_pdf

    from .tables.find_position_of_one_table import find_position_of_one_table
    from .tables.find_positions_of_all_tables import find_positions_of_all_tables
    from .tables.remove_one_table import remove_one_table
    from .tables.update_tables_positions_checked import update_tables_positions_checked

    from .structures.find_header import find_header
    from .structures.find_toc import find_toc
    from .structures.find_sections_pages import find_sections_pages
    from .structures.compare_standard_toc import compare_standard_toc
    from .structures.find_fin_report_structure import find_fin_report_structure

    from .tools.compare_positions_order import compare_positions_order
    from .tools.convert_to_chinese_number import convert_to_chinese_number
    # from .tools.show_results import show_results
